#include<bits/stdc++.h>
using namespace std;
#define rep(i, l, r) for (int i = l; i <= r; i++)
#define pii pair<int, int>
#define int long long
#define pb push_back
#define fi first
#define se second
#define endl '\n'
double pi = acos(-1);
const int N = 1e6, mod = 1e9+7, inf = 1e18 + 5;
int fpow(int a,int b){
    int res = 1;
    while(b){
        if(b&1) res = res * a % mod;
        a = a * a % mod;
        b >>= 1;
    }
    return res % mod;
}


/*
    每一局从左向右翻两个数
    <1>:回合刚开始,之前有两张一样牌出现,去翻这两个,该回合删掉
    <2>:先翻第一张牌,如果是旧牌,去翻之前一样的那张,该回合删掉
    <3>:先翻第一张牌,如果是新牌,接着翻第二张,和第一张一样，该回合删掉
    <4>:先翻第一张牌,如果是新牌,接着翻第二张,不一样,那就合上(该回合没删)

    我们看看对于给定n，最多最少操作次数
    然后再根据给定k,去构造合适方案

    有n对牌,不管怎么放置,一回合最多删掉一对,所以至少需要n回合
    (1): k < n 特判
    
    然后我们去找最多可以多少回合

    当前有n回合是要删掉的,还剩下m = k-n回合去浪费
    我们去分析前面的第<4>条,第一张牌必须是新牌,第二张也要是和前面都不一样的新牌
    假设n为 4
    我们首先想到 1 2 3 4 1 2 3 4
    这样前两回合是1 2,  3 4,  互不相同, 但后面能选的就没有了,在此之后每回合都会删掉一个数

    12341234
    1: 1 2
    2: 3 4
    3: 1 删1
    4: 2 删2
    5：3 删3
    6：4 删4
    该构造方式,最大回合是6

    根据手模,我们发现最大回合是7
    ：要让第一张是新牌,第二张是旧牌
    这样这一回合只能知道一个新牌的位置,并且这一回合删不了,只能下一回合删

    12314234
    1: 1 2
    2: 3 1
    3: 删1
    4: 4 2
    5: 删2
    6: 3 4(删3)
    7: 删4


    我们总结下: 我们每次引入一对牌(新,旧),都会'浪费'一个回合
    第一个回合固定下(1,2),一个回合
    还有n-2种牌,浪费n-2个回合
    综上: k_max = n 个固定删除回合 + n-2+1 个浪费回合
        k_max = 2*n-1

    (2) k > 2*n-1 特判

    我们分析完了 k 要在[n, 2*n-1] 直接
    我们看看怎么构造？
    m = k - n + 1 (参与交错排列的牌的种类数)
    (3) m种牌交错，我们能制造出来m-1个浪费回合
    首先: 第一局固定为 1 2
    中间我们 for遍历 (3 ~ )
    每次选i 和 i-2
    如(1 2) (3 1) (4 2) (5 3) ...
    为什么是i 和 i-2 : 因为i是我们要引入的新牌,而i-2是之前那张未配对的牌
    这样每次我们都只有2张待配对的牌
    这样我们最后剩下m-1和m没有配对,我们下一局输出这两个即可

    (4) 接着剩下的牌[m+1 ~ n]
    这些牌没有额外的回合去浪费了
    直接for 遍历输出 i i 即可
 
    最后检查下有没有问题即可
*/
void solve(){
    int n,k; cin >> n >> k; 
    if(k < n || k > 2 * n - 1){
        cout << "NO" << endl;
        return;
    }
    cout << "YES" << endl;
    if(k == n){
        for(int i = 1; i <= n; i++){
            cout << i << " " << i << " ";
        }
        cout << endl;
        return;
    }     
    int m = k - n + 1; 
    cout << 1 << " "<< 2 << " ";
    for(int i = 3; i <= m; i++){
        cout << i << " " << i-2 << " ";
    }
    cout << m-1 << " "<< m << " ";
    for(int i = m + 1; i <= n; i++){
        cout << i << " " << i << " ";

    }
    cout << endl;
}

signed main(){
    ios::sync_with_stdio(false);
    cin.tie(0);cout.tie(0);
    int T = 1;
    cin >> T;
    while(T--)
        solve();
    return 0;
}
/*
    123123
    1: 1 2
    2: 3 1
    3: 删1
    4: 2 删2
    5: 3 删3
    
    12314234
    1: 1 2
    2: 3 1
    3: 删1
    4: 4 2
    5: 删2
    6: 3 4(删3)
    7: 删4
*/